{
    "data": [
        {
            "text": "1. Name acyclic unsaturated carbon compound. 1 Mark  Ans: Acyclic unsaturated carbon compounds are those which contain double or triple bonds between carbon atoms and are acyclic in nature. For example: Butene. "
        },
        {
            "text": "2. The change in magnetic field lines in a coil is the cause of induced electric current in it. Name the underlying phenomenon.1 Mark Ans: According to the phenomenon of electromagnetic induction, the change in magnetic field lines in a coil is the cause of induced electric current in it."
        },
        {
            "text": "3. The growing size of the human population is a cause of concern for all people. The rate of birth and death in a given population will determine its size. Reproduction is the process by which organisms increase their population. The process of sexual maturation for reproduction is gradual and takes place while general body growth is still going on. Some degree of sexual maturation does not necessarily mean that the mind or body is ready for sexual acts or for having and bringing up children. Various contraceptive devices are being used by human beings to control the size of the population. (a) List two common signs of sexual maturation in boys and girls. 1 Mark Ans: Two common signs of sexual maturation in boys and girls are: 1. Pubic, underarm and facial hair development. 2. Common signs of acne development. (b) What is the result of reckless female foeticide? 1 Mark Ans: The reckless female foeticide will ultimately result in men: women ratio. Since due to foeticide the number of females decreases with respect to the number of males. (c) Which contraceptive method changes the hormonal balance of the body?1 Mark Ans: The oral contraceptive method changes the hormonal balance of the body so this woman does not ovulate by taking such pills. (d) Write two factors that determine the size of a population. 1 Mark Ans: Two factors which determine the size of population are: 1. Birth rate 2. Death rate "
        },{
            "text": " Human body is made up of five important components, of which water is the main component. Food as well as potable water are essential for every human being. The food is obtained from plants through agriculture. Pesticides are being used extensively for a high yield in the fields. These pesticides are absorbed by the plants from the soil along with water and minerals and from the water bodies these pesticides are taken up by the aquatic animals and plants. As these chemicals are not biodegradable, they get accumulated progressively at each trophic level. The maximum concentration of these chemicals gets accumulated in our bodies and greatly affects the health of our mind and body. (a) Why is the maximum concentration of pesticides found in human beings?                                                       1 Mark Ans: Pesticides are extensively used for good production of crops and these crops will be consumed by us. Hence these pesticides transfer to the human body. Therefore the maximum concentration of pesticides found in human beings. (b) Give one method which could be applied to reduce our intake of pesticides through food to some extent.                                        1 Mark Ans: Before eating food we must ensure to wash it properly so that if there is a layer of pesticides on the fruit then it gets washed.  (c) Various steps in a food chain represent:                                           1 Mark (a) Food web                   (b) Trophic level (c) Ecosystem                  (d) Biomagnification  Ans: The various steps which are represented in the food chain are known as trophic level Each trophic level represents a class of organism. Hence the correct option is (b). (d) With regard to various food chains operating in an ecosystem, man is a: (a) Consumer                                (b) Producer (c) Producer and consumer      (d) Producer and decomposer            1 Mark Ans: According to various food chains operating in the ecosystem, a man is a consumer which does not produce anything of its own. It only consumes. Hence the correct option is (a). "
        },{
            "text": "5. Calcium oxide reacts vigorously with water to produce slaked lime. () () +→ 2(l) s 2(aq.) CaOHO  CaOH This reaction can be classified as: (A) Combination reaction (B) Exothermic reaction (C) Endothermic reaction (D) Oxidation reaction Which of the following is a correct option? (a) (A) and (C) (b) (C) and (D) (c) (A), (C) and (D) (d) (A) and (B) 1 Mark Ans: The above reaction is an exothermic in nature which releases large amounts of heat and it is an example of a combination reaction. Hence the correct option is (d). "
        },{
            "text": "When hydrogen sulphide gas is passed through a blue solution of copper sulphate, a black precipitate of copper sulphide is obtained and the sulphuric acid so formed remains in the solution. The reaction is an example of a: 1 Mark (a) Combination reaction (b) Displacement reaction (c) Decomposition reaction (d) Double displacement reaction Ans: The reaction can be represented as: () 2 4(aq.) (s)24(aq.) g HS+CuSO  CuS+HSO → Thus it is a double displacement reaction. Hence the correct option is (d). "
        },{
            "text": "15. 1g of copper powder was taken in a China dish and heated. What change takes place on heating? When hydrogen gas is passed over this heated substance, a visible change is seen in it. Give the chemical equations reactions, the name and the color of the products formed in each case. 3 Marks Ans: When 1g Copper powder is taken in a china dish and then it is heated, a black colored substance is formed which is known as copper oxide. The above reaction can be represented by using the equation as: Heat 2 (black) 2Cu+O  2CuO → This is because the copper is being oxidized to copper oxide which is black in color. Now when hydrogen gas is passed over this heated substance which is copper oxide then the copper metal is obtained. The reaction can be represented as: Heat (black)2 (s)2(l) CuO+H  Cu + HO → Thus we get copper back on heating the copper oxide with hydrogen gas and also water is formed as a by-product of reaction."
        }
    ]
}